[
  {
    "name": "Pitch Changer",
    "description": "The Pitch Changer allows you to change the pitch of an audio and listen to it. ",
    "pic": "/profile.jpeg",
    "link": "/pitch-changer/"
  },
  {
    "name": "Test Manager",
    "description": "Manage your tests at one platform and set a timer for each! \nI first thought of this project when I was taking a test in the classroom. I wanted to make a giant clock on the computer screen in my classroom, so I built one <a href='https://onlyahuman7926.github.io/Clock' target='_blank'>here</a>. However, since people were saying that this can be a timer for other things, I added more features such as adding names to tests and stuff. (now it's more like a todo list)",
    "pic": "/profile.jpeg",
    "link": "/tm/"
  },
  {
    "name": "Mandelbrot Fractal",
    "description": "The Mandelbrot fractal is a famous thing in mathematics known for its fine details. Although it may be a bit slow and only supports zooming, I've made it look as nice as possible. ",
    "pic": "/project/pics/dark_mandelbrot.png",
    "link": "/Mandelbrot-Set/"
  },
  {
    "name": "LightChat",
    "description": "A light-mode chat that features half of Discord. Aside from the ability to send messages and a UI that I think was amazing, it has a type indicator, MarkDown formatting support, an always-changing background, and the ability to change the theme color from white to any other color. ",
    "pic": "/project/pics/lightbulb.png",
    "link": ""
  },
  {
    "name": "VStart",
    "description": "My first ever coding project. VStart is a browser homepage that contains what most home pages have, and it's cleaner than most others (2345 home page, etc.).",
    "pic": "/project/pics/vstart.avif"
  },
  {
    "name": "Python C++ Compiler",
    "description": "Tired of opening your IDE or terminal to run C++ files? Use this compiler! <br>I wrote a Python program that runs the GCC compiling command and running the .exe file afterwords. I then packaged the compiler into an application and made it open C++ files by default. It's convenient, but it's also slow (it takes about 0.9s to run a Hello World program). ",
    "pic": "/profile.jpeg"
  },
  {
    "name": "WLSA School House",
    "description": "A thing. <br><br>This one will go big if things go well. ",
    "pic": "/wlsa-sh/soilwater/assets/website/logo.png",
    "link": "/wlsa-sh/"
  }
]